# CannotAlignSupportOnPosts Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..CannotAlignSupportOnPosts Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Cannot align the support on the posts.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotAlignSupportOnPosts { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotAlignSupportOnPosts As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotAlignSupportOnPosts {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace